license-manager/app/controllers/licenses_controller.rb

  def index
    current_user = session[:user]
    if current_user.is_admin
      @licenses = License.order("created_at DESC").page(params[:page])
---
SELECT COUNT(*) FROM `licenses`
SELECT `licenses`.* FROM `licenses` ORDER BY created_at DESC LIMIT 10 OFFSET 0

  def show
    @license = License.find(params[:id])
    @products = Product.all
---
SELECT "licenses".* FROM "licenses" WHERE "licenses"."id" = ? LIMIT 1  [["id", "5"]]
SELECT `products`.* FROM `products`

  def new
    @license = License.new
    @products = Product.all
    @versions = format_version SystemConfig.first[:license_path]
---
SELECT `products`.* FROM `products`
SELECT `system_configs`.* FROM `system_configs` LIMIT 1

  def create
    @license = License.new(params[:license])
    @license.applicant = session[:user][:name]
    products = Product.find_by_ids(params[:ck_product_ids])
    begin
      License.transaction do
        if (@license.save) && (LicenseProductship.save_by_license_and_products @license,products)
---
INSERT INTO "license_productships" ("created_at", "license_id", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 20 Dec 2012 03:37:39 UTC +00:00], ["license_id", 2], ["product_id", 7], ["updated_at", Thu, 20 Dec 2012 03:37:39 UTC +00:00]]
INSERT INTO `licenses` (`applicant`, `created_at`, `custom_name`, `expires_date`, `local_check`, `local_check_type`, `memo`, `publish_content`, `publish_reason`, `updated_at`, `user_number`, `version`) VALUES ('admin', '2012-06-27 16:37:40', 'oop', '2012-06-30', '', 'NO_LOCAL_CHECK', '', '', '', '2012-06-27 16:37:40', 20, '5.5')

  def destroy
    flash[:error] = I18n.t('license.delete_failed') unless License.delete params[:id],session[:license_path]
---
DELETE FROM `licenses` WHERE `licenses`.`id` = 3

  def download
    license = License.find(params[:id])
---
SELECT "licenses".* FROM "licenses" WHERE "licenses"."id" = ? LIMIT 1  [["id", "26"]]