license-manager/app/controllers/products_controller.rb

SELECT COUNT(*) FROM `products`
SELECT `products`.* FROM `products` ORDER BY name LIMIT 10 OFFSET 0
---
  def index
    @products = Product.order(:name).page(params[:page])