license-manager/app/controllers/system_configs_controller.rb

SELECT "system_configs".* FROM "system_configs" WHERE "system_configs"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @system_config = SystemConfig.find(params[:id])

SELECT "system_configs".* FROM "system_configs" WHERE "system_configs"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @system_config = SystemConfig.find(params[:id])

SELECT "system_configs".* FROM "system_configs" WHERE "system_configs"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE `system_configs` SET `license_path` = '/Users/liuyang/Programer/versions', `updated_at` = '2012-06-27 16:36:28' WHERE `system_configs`.`id` = 1
---
  def update
    @system_config = SystemConfig.find(params[:id])

    respond_to do |format|
      if @system_config.update_attributes(params[:system_config])