license-manager/app/controllers/users_controller.rb

SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` ORDER BY name LIMIT 10 OFFSET 0
---
  def index
    @users = User.order(:name).page(params[:page])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    if session[:user][:is_admin]
      @user = User.find(params[:id])